#+TITLE:  5th Quiz
#+AUTHOR: Rick Neff
#+EMAIL:  rick.neff@gmail.com
#+LANGUAGE:  en
#+OPTIONS:   H:4 num:nil toc:nil \n:nil @:t ::t |:t ^:t *:t TeX:t LaTeX:t
#+STARTUP:   showeverything

These are some questions about Cantor Diagonalization, Diophantine
Equations, and Continued Fractions.

* 2nd Question

  In the Cantor Diagonalization argument showing that the cardinality
  of the power set of the set of positive integers is uncountably
  infinite, the following is a function that constructs the \(n^{th}\)
  "diagonal" digit; which digits, taken all at once, are the elements
  of the subset necessarily missing from the supposedly complete list
  of subsets:

  \(Digit(n) = 1 - Table(n, n)\)

  - [X] True
  - [ ] False

#+BEGIN_SRC emacs-lisp
(defun table (i j)
(% (/ (- i 1) (expt 2 (- j 1))) 2)
)

(- 1 (table 20 20))
#+END_SRC

#+RESULTS:
: 1

